{
  "roles": [
    {
      "role_name": "Food Bank",
      "narrative": "# GENERAL INFORMATION\n\nThe Citizens' Resource Hub and the Community Harvest food bank were connected by a shared stakeholder when it became clear both were seeking to open branches in the same area. Because you have relatively compatible needs and serve overlapping populations, you stand to save considerable resources and support each other by sharing space. After spending time exploring the broad topic and lining up a list of possible shared venues, both sides agree that a viable partnership is very desirable—in this increasingly uncertain and cash-strapped world, there's not much room for waste.\n\nThe exact renovation and usage details don't need to be worked out right now, but the goal is to hammer out a broad plan covering a few key areas.\n\n---\n\n## YOUR ROLE: Food Bank\n\n**Your Mission:** You're expanding your regional food distribution network into this area. Your organization collects donated food, organizes it, and distributes it to families and individuals facing food insecurity. This new location will serve as both a distribution point where clients pick up groceries and a volunteer hub where your team sorts donations and manages logistics.\n\n**Your Funding Reality:** As a mostly volunteer-run organization, you don't have the staff payroll costs that other nonprofits face. That makes rent and maintenance your largest budget items—every dollar of rent matters significantly to your bottom line. You're reallocating resources from your central budget to make this expansion happen, and you need to keep both up-front and ongoing costs as low as possible.\n\n**Your Space Needs:** Day-to-day operations don't require much space—you need one dedicated private office for administrative work and client meetings. However, you also need flex space that you can expand into when volunteers are receiving donations, organizing stock, and managing logistics. These sessions often involve new volunteer orientation and training, and the work tends to spread out and take over available space. More storage space is always better, and ideally you'd have delivery bay access too.\n\n**Your Strategic Concerns:** You're very flexible on the physical space configuration since volunteers can adapt to various setups, which means your share of renovation costs will be relatively low. However, you still face a substantial upfront conversion cost, so you prefer a longer lease to make sure it's worth the setup investment. But even if you get a shorter lease, you expect CAB will decide to stick around long term. And if they don't, chances are good you could find another compatible organization to share the space.\n\n**The Weekend Question:** One key concern for you is weekend access. Saturdays are when most of your volunteers are available, and you can handle a week's worth of logistics without getting in the way of clients picking up groceries. Some food banks do manage to do everything on weekdays, especially if they have a larger space, but it's not ideal.\n\n**What You Really Want:** The ideal scenario is a bigger space with delivery bay access that gives you room for logistics operations. Like CAB, you prefer a downtown location, but space and affordability are even bigger concerns.\n\n**Your Priorities:**\n\n- **Location:** Bigger space for logistics and storage, plus delivery bay access if possible.  Space and affordability matter most.\n- **Renovation Costs:** Since you're flexible on space configuration, your renovation needs are modest. Usually, you do very little to adapt spaces for new locations.  You'd prefer CAB to shoulder more of the renovation costs since they have more specific requirements.\n- **Rent Split:** This is your largest ongoing expense, so every percentage point matters. Since CAB has more specific needs and you're flexible, you'd prefer they pay a bit more of the rent.\n- **Lease Term:** You need stability to justify your upfront investment and establish reliable community operations. You prefer longer terms like 7-10 years.\n- **Evening/Weekend Access:** This is critical for volunteer coordination. Weekend-only access for FB would be ideal, shared access is workable, closed is problematic.\n- **Space Allocation:** More storage/flex space would be helpful for logistics operations, but it's not critical since you have off-site options. You can work with various configurations.\n\n**Your Goal:** Maximize your total points across all issues. The negotiation succeeds only if both parties reach agreement on all six issues.",
      "BATNA":"Your best alternative to negotiated agreement ('BATNA') is to proceed with your original plan, and rent on your own.",
      "RP" : 25,
      "scoresheet": {
        "Location_Choice": [
          { "option": "Peripheral-Big (w/ delivery bay)", "score": 60 },
          { "option": "Medium-Medium (w/ delivery bay)", "score": 45 },
          { "option": "Central-Small", "score": 30 },
          { "option": "Central-Big", "score": 15 },
          { "option": "Peripheral-Small", "score": 0 }
        ],
        "Renovation_Cost_Percent_CAB": [
          { "option": "30%", "score": 0 },
          { "option": "40%", "score": 20 },
          { "option": "50%", "score": 40 },
          { "option": "60%", "score": 60 },
          { "option": "70%", "score": 80 }
        ],
        "Rent_Split_Percent_CAB": [
          { "option": "45%", "score": -20 },
          { "option": "50%", "score": 0 },
          { "option": "55%", "score": 20 },
          { "option": "60%", "score": 40 }
        ],
        "Lease_Term": [
          { "option": "3 years", "score": 0 },
          { "option": "5 years", "score": 13 },
          { "option": "7 years", "score": 27 },
          { "option": "10 years", "score": 40 }
        ],
        "Evening_Weekend_Access": [
          { "option": "Closed", "score": 0 },
          { "option": "Shared, booking system", "score": 40 },
          { "option": "FB only", "score": 80 }
        ],
        "Space_Allocation": [
          { "option": "60% office, 40% storage/flex", "score": 0 },
          { "option": "50% office, 50% storage/flex", "score": 10 },
          { "option": "40% office, 60% storage/flex", "score": 20 }
        ]
      }
    },
    {
      "role_name": "Citizens Advice Bureau",
      "narrative": "## GENERAL INFORMATION\n\nThe Citizens' Resource Hub and the Community Harvest food bank were connected by a shared stakeholder when it became clear both were seeking to open branches in the same area. Because you have relatively compatible needs and serve overlapping populations, you stand to save considerable resources and support each other by sharing space. After spending time exploring the broad topic and lining up a list of possible shared venues, both sides agree that a viable partnership is very desirable—in this increasingly uncertain and cash-strapped world, there's not much room for waste.\n\nThe exact renovation and usage details don't need to be worked out right now, but the goal is to hammer out a broad plan covering a few key areas.\n\n---\n\n## YOUR ROLE: Citizens Advice Bureau (CAB)\n\n**Your Mission:** You're opening a new branch of a national network to serve this community. Your work involves helping people navigate complex benefits, housing, debt, and legal issues—all requiring confidential one-on-one consultations with trained advisors.\n\n**Your Funding Reality:** Like most advice services, your largest budget item is professional staff salaries—rent is important, but it's a smaller percentage of your overall costs. Here's where things get interesting: your branch is responsible for all ongoing costs, but a substantial portion of upfront renovation costs is covered by an anonymous donor who grew up in the area and \"learned all this stuff the hard way.\" This donor wants to give back, but they're funding the setup, not the long-term operations.\n\n**Your Space Needs:** You need at least 2 private offices for confidential client meetings—these are non-negotiable for your work. Ideally, you'd have 3 dedicated private offices, but you could make do with 2 private offices plus 2 hot desks shared with the Food Bank if needed. The rest of your staff can work in an open floor plan. You don't need much storage—mostly just filing cabinets for case records.\n\n**Your Strategic Concerns:** Because the donor covers upfront costs but you're on the hook for ongoing expenses, you're more sensitive to long-term commitments than renovation costs. You want to avoid getting locked into a lengthy lease if the branch doesn't take off. You also want to minimize recurring costs like evening/weekend staffing—your services are typically needed during business hours, and for special events, clients can travel to other branches in the network. That said, if the space is going to be open evenings/weekends anyway, you'd want access for occasional workshops or staff overtime.\n\n**What You Really Want:** The ideal scenario is a larger space that gives you room to grow as the branch establishes itself. While a downtown location would be more professional and convenient for clients, you're pragmatic—cost savings and space matter more than prestige. A bigger peripheral location that's affordable beats a cramped expensive office downtown.\n\n**Your Priorities:**\n\n- **Location:** Bigger space for future growth is the priority—even if it means being peripheral rather than downtown. Space and affordability beat central location.\n- **Renovation Costs:** You have donor funding for a substantial portion, so while you prefer to pay less, you have some flexibility here. Money is still money, even with donor support.\n- **Rent Split:** You operate on a lean budget, and unlike renovation (one-time), rent is forever. You prefer to pay less, though it's not your biggest concern since staff salaries dwarf rent costs.\n- **Lease Term:** Flexibility is key—you want shorter terms so you're not trapped if the branch struggles. You strongly prefer 3-5 years maximum.\n- **Evening/Weekend Access:** You prefer the space closed to save on insurance and facilities costs. If it's open, you want occasional access.\n- **Space Allocation:** You need office space for private consultations. Storage needs are minimal—you prefer 60% office minimum.\n\n**Your Goal:** Maximize your total points across all issues. The negotiation succeeds only if both parties reach agreement on all six issues.",
      "BATNA":"Your best alternative to negotiated agreement ('BATNA') is to proceed with your original plan, and rent on your own.",
      "RP" : 25,
      "scoresheet": {
        "Location_Choice": [
          { "option": "Peripheral-Big (w/ delivery bay)", "score": 60 },
          { "option": "Medium-Medium (w/ delivery bay)", "score": 45 },
          { "option": "Central-Small", "score": 30 },
          { "option": "Central-Big", "score": 15 },
          { "option": "Peripheral-Small", "score": 0 }
        ],
        "Renovation_Cost_Percent_CAB": [
          { "option": "30%", "score": 40 },
          { "option": "40%", "score": 30 },
          { "option": "50%", "score": 20 },
          { "option": "60%", "score": 10 },
          { "option": "70%", "score": 0 }
        ],
        "Rent_Split_Percent_CAB": [
          { "option": "45%", "score": 60 },
          { "option": "50%", "score": 40 },
          { "option": "55%", "score": 20 },
          { "option": "60%", "score": 0 }
        ],
        "Lease_Term": [
          { "option": "3 years", "score": 80 },
          { "option": "5 years", "score": 40 },
          { "option": "7 years", "score": 20 },
          { "option": "10 years", "score": 0 }
        ],
        "Evening_Weekend_Access": [
          { "option": "Closed", "score": 20 },
          { "option": "Shared, booking system", "score": 10 },
          { "option": "FB only", "score": 0 }
        ],
        "Space_Allocation": [
          { "option": "60% office, 40% storage/flex", "score": 80 },
          { "option": "50% office, 50% storage/flex", "score": 40 },
          { "option": "40% office, 60% storage/flex", "score": 0 }
        ]
      }
    }
  ]
}
